/* If a X500 name has a description and a common name we display CommonName (Description) using this format string */
"%@ (%@)" = "%1$@ (%2$@)";

/* Format string used to build a list of values, first argument is list second argument is to be appended element */
"%@, %@" = "%1$@ %2$@";

/* Format string for encoded field data (e.g. Sequence; 128 bytes; data = 00 00 ...) */
"%@; %d %@; data = %@" = "%1$@; %2$d %3$@; ข้อมูล = %4$@";

/* format string to turn version number into a string */
"%d" = "%d";

/* Value of a field if its length is 0 */
"<NULL>" = "<NULL>";

/* CRL Distribution Points extension supported reason name */
"AA Compromise" = "ข้อประนีประนอมของ AA";

/* Label of field in authority info access extension */
"Access Location" = "ที่ตั้งการเข้าถึง";

/* Label of field in authority info access extension */
"Access Method" = "วิธีการเข้าถึง";

/* CRL Distribution Points extension supported reason name */
"Affiliation Changed" = "เกิดเปลี่ยนการรับรอง";

/* Label of the algorithm subfield of an AlgorithmIdentifer */
"Algorithm" = "อัลกอริทึม";

/* Label of field in Authority Key Identifier extension */
"Authority Certificate Serial Number" = "หมายเลขประจำใบรับรองผู้อนุญาต";

/* Authority info access extension label */
"Authority Information Access" = "การเข้าถึงข้อมูลอนุมัติ";

/* Authority Key Identifier extension label */
"Authority Key Identifier" = "หมายเลขประจำกุญแจผู้อนุญาต";

/* Label used for Basic Constraints when value is invalid */
"Basic Constraints" = "ข้อจำกัดพื้นฐาน";

/* First argument to SEC_BLOB_KEY format string for a bit string */
"Bit string" = "สายอักขระบิต";

/* No comment provided by engineer. */
"bits" = "บิต";

/* First argument to SEC_BLOB_KEY format string for a Byte string */
"Byte string" = "สายอักขระไบต์";

/* Third argument to SEC_BLOB_KEY format string for a byte string */
"bytes" = "ไบต์";

/* CRL Distribution Points extension supported reason name */
"CA Compromise" = "ข้อประนีประนอมของ CA";

/* X.509 key usage bitfield name */
"Cert Sign" = "ลงชื่อใบรับรอง";

/* Label for boolean is_ca property of a basic constraints extension */
"Certificate Authority" = "ผู้อนุมัติใบรับรอง";

/* CRL Distribution Points extension supported reason name */
"Certificate Hold" = "เจ้าของใบรับรอง";

/* Certificate Policies extension label */
"Certificate Policies" = "นโยบายใบรับรอง";

/* No comment provided by engineer. */
"Certificate Type" = "ประเภทใบรับรอง";

/* CRL Distribution Points extension supported reason name */
"Cessation Of Operation" = "หยุดการดำเนินการ";

/* Label of field in Certificate Policies extension */
"CPS URI" = "CPS URI";

/* Label of field in extension that indicates whether this extension is critical */
"Critical" = "สำคัญ";

/* CRL Distribution Points extension label */
"CRL Distribution Points" = "จุดแจกจ่าย CRL";

/* Label for CRL issuer field of CRL Distribution Points extension */
"CRL Issuer" = "ผู้ออก CRL";

/* X.509 key usage bitfield name */
"CRL Sign" = "ลงชื่อ CRL";

/* Label for raw data of extension (used for unknown extensions) */
"Data" = "ข้อมูล";

/* X.509 key usage bitfield name */
"Data Encipherment" = "การเข้ารหัสลับข้อมูล";

/* X.509 key usage bitfield name */
"Decipher Only" = "เฉพาะตัวถอดรหัส";

/* X.509 key usage bitfield name */
"Digital Signature" = "ลายเซ็นดิจิตอล";

/* label for general name field value */
"Directory Name" = "ชื่อไดเร็กทอรี";

/* label for general name field value */
"DNS Name" = "ชื่อ DNS";

/* label for general name field value */
"EDI Party Name" = "ชื่อคู่กรณี EDI";

/* label for general name field value */
"Email Address" = "ที่อยู่อีเมล";

/* X.509 key usage bitfield name */
"Encipher Only" = "เฉพาะตัวเข้ารหัส";

/* No comment provided by engineer. */
"Expired" = "หมดเวลาแล้ว";

/* Label of expiration date value when certificate is temporally valid */
"Expires" = "หมดเวลา";

/* Label of field in Certificate Policies extension */
"Explicit Text" = "ข้อความไม่เหมาะสม";

/* Extended key usage extension label */
"Extended Key Usage" = "การใช้งานกุญแจส่วนขยาย";

/* Label used for General Name entry when value is invalid */
"General Name" = "ชื่อทั่วไป";

/* Label used for General Names when value is invalid */
"General Names" = "ชื่อทั่วไป";

/* No comment provided by engineer. */
"Hostname mismatch." = "ชื่อโฮสต์ไม่ตรง";

/* Label of field in policy constraints extension */
"Inhibit Policy Mapping" = "ความสัมพันธ์นโยบายยับยั้ง";

/* Label of a value is printed into this string if the data is not valid */
"Invalid %@" = "“%@” ไม่ถูกต้อง";

/* No comment provided by engineer. */
"Invalid certificate chain linkage." = "การเชื่อมโยงต่อเนื่องของใบรับรองไม่ถูกต้อง";

/* label for general name field value */
"IP Address" = "ที่อยู่ IP";

/* No comment provided by engineer. */
"Issued By" = "ออกโดย";

/* No comment provided by engineer. */
"Issuer Name" = "ชื่อผู้ออก";

/* No comment provided by engineer. */
"Issuer Summary" = "ข้อมูลสรุปผู้ออก";

/* No comment provided by engineer. */
"Issuer Unique ID" = "ID เฉพาะของผู้ออก";

/* X.509 key usage bitfield name */
"Key Agreement" = "ข้อตกลงกุญแจ";

/* CRL Distribution Points extension supported reason name */
"Key Compromise" = "ข้อประนีประนอมของกุญแจ";

/* X.509 key usage bitfield name */
"Key Encipherment" = "การเข้ารหัสลับกุญแจ";

/* Label of field in Subject or Authority Key Identifier extension */
"Key Identifier" = "ตัวระบุกุญแจ";

/* Subsection label in CRL Distribution Points extension. */
"Name Relative To CRL Issuer" = "กำหนดชื่อที่เกี่ยวข้องกับผู้ออก CRL";

/* Value for a boolean property when it's value is false (example critical: no) */
"No" = "ไม่";

/* X.509 key usage bitfield name */
"Non-Repudiation" = "การป้องกันการปฏิเสธความรับผิดชอบต่อข้อมูล";

/* field value of parameters field when no parameters are present */
"none" = "ไม่มี";

/* format string for undisplayed field data with a given DER tag and length */
"not displayed (tag = %@; length %d)" = "ไม่แสดง (แท็ก = %1$@; ยาว %2$d)";

/* label indicating the date after which something is no longer valid */
"Not Valid After" = "ใช้ไม่ได้หลังจาก";

/* label indicating the soonest date at which something is valid */
"Not Valid Before" = "ใช้ไม่ได้ก่อน";

/* Label of field in Certificate Policies extension */
"Notice Numbers" = "หมายเลขแจ้งเตือน";

/* Netscape certificate type usage value */
"Object Signing" = "การลงชื่อวัตถุ";

/* Netscape certificate type usage value */
"Object Signing CA" = "CA แบบลงชื่อวัตถุ";

/* value of an oid field if it's length is more than what we allow for oids */
"Oid too long" = "Oid ยาวเกินไป";

/* No comment provided by engineer. */
"One or more certificates have expired or are not valid yet." = "ใบรับรองได้หมดเวลาแล้วหรือยังใช้ไม่ได้อย่างน้อยจำนวนหนึ่งใบ";

/* No comment provided by engineer. */
"One or more unsupported critical extensions found." = "ได้พบส่วนขยายสำคัญที่ไม่รองรับจำนวนอย่างน้อยหนึ่งรายการ";

/* Label of field in Certificate Policies extension */
"Organization" = "องค์กร";

/* Label used for Other Name RDN when value is invalid */
"Other Name" = "ชื่ออื่น";

/* Label of the parameters subfield of an AlgorithmIdentifer */
"Parameters" = "พารามิเตอร์";

/* Label for path length constraint property of a basic constraints extension */
"Path Length Constraint" = "ข้อจำกัดความยาวเส้นทาง";

/* Policy constraints extension label */
"Policy Constraints" = "ข้อจำกัดนโยบาย";

/* Format string for label of field in Certificate Policies extension, %d is a monotonic increasing counter starting at 1 */
"Policy Identifier #%d" = "ตัวระบุ #%d ของนโยบาย";

/* Format string for label of field in Certificate Policies extension, %d is a monotonic increasing counter starting at 1 */
"Policy Qualifier #%d" = "คุณสมบัติเหมาะสม #%d ของนโยบาย";

/* No comment provided by engineer. */
"Policy requirements not met." = "ข้อกำหนดนโยบายไม่ผ่าน";

/* Label for an invlaid private key se perion value */
"Private Key Usage Period" = "ระยะเวลาใช้กุญแจส่วนตัว";

/* CRL Distribution Points extension supported reason name */
"Privilege Withdrawn" = "เลิกถอนสิทธิพิเศษ";

/* No comment provided by engineer. */
"Public Key Algorithm" = "อัลกอริทึมกุญแจสาธารณะ";

/* No comment provided by engineer. */
"Public Key Data" = "ข้อมูลกุญแจสาธารณะ";

/* Label of field in extended key usage extension */
"Purpose" = "วัตถุประสงค์";

/* Label of field in Certificate Policies extension */
"Qualifier" = "คุณสมบัติเหมาะสม";

/* Label of a RDN */
"RDN" = "RDN";

/* CRL Distribution Points extension supported reasons bitfield label */
"Reasons" = "เหตุผล";

/* label for general name field value */
"Registered ID" = "ID ที่ลงทะเบียน";

/* Label of field in policy constraints extension */
"Require Explicit Policy" = "ต้องการนโยบายชัดเจน";

/* Netscape certificate type usage value */
"Reserved" = "สงวนไว้";

/* No comment provided by engineer. */
"Root certificate is not trusted." = "ใบรับรองหลักเชื่อถือไม่ได้";

/* Netscape certificate type usage value */
"S/MIME" = "S/MIME";

/* Netscape certificate type usage value */
"S/MIME CA" = "S/MIME CA";

/* First argument to SEC_BLOB_KEY format string for a Sequence */
"Sequence" = "ลำดับ";

/* No comment provided by engineer. */
"Serial Number" = "หมายเลขประจำ";

/* First argument to SEC_BLOB_KEY format string for a Set */
"Set" = "ตั้งค่า";

/* No comment provided by engineer. */
"Signature" = "ลายเซ็น";

/* No comment provided by engineer. */
"Signature Algorithm" = "อัลกอริทึมลายเซ็น";

/* Netscape certificate type usage value */
"SSL CA" = "SSL CA";

/* Netscape certificate type usage value */
"SSL client" = "ไคลเอนต์ SSL";

/* Netscape certificate type usage value */
"SSL server" = "เซิร์ฟเวอร์ SSL";

/* Subject Key Identifier extension label */
"Subject Key Identifier" = "ตัวระบุกุญแจชื่อเรื่อง";

/* No comment provided by engineer. */
"Subject Name" = "ชื่อเรื่อง";

/* No comment provided by engineer. */
"Subject Unique ID" = "ID เฉพาะของชื่อเรื่อง";

/* CRL Distribution Points extension supported reason name */
"Superseded" = "ถูกแทนที่";

/* No comment provided by engineer. */
"This certificate has an issuer that has expired" = "ใบรับรองนี้ประกอบด้วยผู้ออกที่ได้หมดเวลาแล้ว";

/* No comment provided by engineer. */
"This certificate has an issuer that is not yet valid" = "ใบรับรองนี้ประกอบด้วยผู้ออกที่ยังใช้ไม่ได้";

/* No comment provided by engineer. */
"This certificate has expired" = "ใบรับรองนี้ได้หมดเวลาแล้ว";

/* No comment provided by engineer. */
"This certificate is not yet valid" = "ใบรับรองนี้ยังใช้ไม่ได้";

/* The certificate is temporally valid */
"This certificate is valid" = "ใบรับรองนี้ใช้ได้";

/* Label of a value is printed into this string if the data can not been parsed according to it's type */
"Unparsed %@" = "%@ ไม่ได้แยกวิเคราะห์";

/* CRL Distribution Points extension supported reason name */
"Unused" = "ไม่ได้ใช้";

/* label for general name field value */
"URI" = "URI";

/* Label for KeyUsage bitfield values */
"Usage" = "การใช้งาน";

/* No comment provided by engineer. */
"Valid from" = "เริ่มใช้";

/* No comment provided by engineer. */
"Version" = "เวอร์ชั่น";

/* label for general name field value */
"X.400 Address" = "ที่อยู่ X.400";

/* Label of a X.501 Name */
"X.501 Name" = "ชื่อของ X.501";

/* No comment provided by engineer. */
"X.509 version %d %scertificate" = "ใบรับรอง X.509 “%2$s” เวอร์ชั่น %1$d";

/* Value for a boolean property when it's value is true (example critical: yes) */
"Yes" = "ใช่";

